src/cf/Enums/ПолитикиУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолитикиУчетаРабочегоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУчитывать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЕжедневныеОтчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЕженедельныеОтчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЕжедневныеИЕженедельныеОтчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Constants/ПолитикаУчетаРабочегоВремени/Ext/ValueManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Истина);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Истина);
	ИначеЕсли Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Истина);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Ложь);
	ИначеЕсли Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕженедельныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Ложь);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Истина);
	Иначе
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Ложь);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
